events/Data Storage Events/Metadata.issue/ALERT.KESI.IssueUpdate.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"    xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KESI</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10010</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.KESI.IssueUpdate</ns1:eventName>
								<ns1:eventId>5748</ns1:eventId>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<s:issue>
									<!-- issue id -->
									<s:issueId>184671</s:issueId>
									<!-- data about new author person (if it's possible to change author, we will support it) -->
									<s:issueAuthor>
										<s:name>Sasa Stojanovic</s:name>
										<s:id>sasa.stojanovic@cimcollege.rs</s:id>
										<s:email>sasa.stojanovic@cimcollege.rs</s:email>
									</s:issueAuthor>
									<!-- new status (Assigned, Open, Verified, Resolved, Closed) -->
									<s:issueStatus>Resolved</s:issueStatus>
									<!-- new resolution (Duplicate, Fixed, Invalid, ThirdParty, WontFix, WorksForMe, Later, Remind) -->
									<s:issueResolution>Fixed</s:issueResolution>
									<!-- new description -->
									<s:issueDescription>Updated description text</s:issueDescription>
									<!-- new keywords -->
									<s:issueKeyword></s:issueKeyword>
									<!-- new product -->
									<s:issueProduct>
										<!-- id of project -->
										<s:productId>Bicho</s:productId>
										<!-- id of component -->
										<s:productComponentId>general</s:productComponentId>
										<!-- project version -->
										<s:productVersion>master</s:productVersion>
									</s:issueProduct>
									<s:issueComputerSystem>
										<!-- id of computer system -->
										<s:computerSystemId></s:computerSystemId>
										<!-- computer system platform -->
										<s:computerSystemPlatform>PC</s:computerSystemPlatform>
										<!-- computer system OS -->
										<s:computerSystemOS>Windows</s:computerSystemOS>
									</s:issueComputerSystem>
									<!-- new priority (1 - 5) -->
									<s:issuePriority>4</s:issuePriority>
									<!-- new severity (Blocker, Critical, Major, Minor, Trivial, Feature) -->
									<s:issueSeverity>Minor</s:issueSeverity>
									<!-- data about new assigned person -->
									<s:issueAssignedTo>
										<s:name>Dusan Zirojevic</s:name>
										<s:id>dusan.zirojevic@cimcollege.rs</s:id>
										<s:email>dusan.zirojevic@cimcollege.rs</s:email>
									</s:issueAssignedTo>
									<!-- data about new issue CC persons -->
									<s:issueCCPerson>
										<s:name>Ivan Obradovic</s:name>
										<s:id>ivan.obradovic@cimcollege.rs</s:id>
										<s:email>ivan.obradovic@cimcollege.rs</s:email>
									</s:issueCCPerson>
									<s:issueCCPerson>
										<s:name>Sasa Stojanovic</s:name>
										<s:id>sasa.stojanovic@cimcollege.rs</s:id>
										<s:email>sasa.stojanovic@cimcollege.rs</s:email>
									</s:issueCCPerson>
									<!-- id of removed issue CC persons -->
									<s:issueCCPersonRemoved>
										<s:id>angel_blue_co2004@yahoo.com</s:id>
									</s:issueCCPersonRemoved>
									<!-- new URL from bugzilla -->
									<s:issueUrl>https://bugzilla.libresoft.es/show_bug.cgi?id=101</s:issueUrl>
									<!-- ids of new related issues -->
									<!-- old depends on stays, new denepnd on is added -->
									<s:issueDependsOnId>10003</s:issueDependsOnId>
									<!-- old blocks stays, new block is added -->
									<s:issueBlocksId>20003</s:issueBlocksId>
									<!-- old duplicate is replaced by new -->
									<s:issueDuplicateOfId>231</s:issueDuplicateOfId>
									<!-- old merged into is replaced by new -->
									<s:issueMergedIntoId>345</s:issueMergedIntoId>
									<!-- ids of removed related issues -->
									<!-- removes depends on with id -->
									<s:issueDependsOnRemovedId>10002</s:issueDependsOnRemovedId>
									<!-- removes blocks on with id -->
									<s:issueBlocksRemovedId>20002</s:issueBlocksRemovedId>
									<!-- date time in format yyyy-MM-dd HH:mm -->
									<s:issueDateOpened>2011-11-08 14:04</s:issueDateOpened>
									<s:issueLastModified>2011-11-15 15:00</s:issueLastModified>
									<!-- new milestone data -->
									<s:issueMilestone>
										<!-- id of milestone -->
										<s:milestoneId></s:milestoneId>
										<!-- milestone date time -->
										<s:milestoneTarget>2011-11-25 14:04</s:milestoneTarget>
									</s:issueMilestone>
									<!-- new/modified comments (should we support option for modifying comments?) -->
									<s:issueComment>
										<s:commentId></s:commentId>
										<!-- if comment number already exist, comment will be updated, if not, it will be added -->
										<s:commentNumber>1</s:commentNumber>
										<s:commentText>Old comment text</s:commentText>
										<s:commentPerson>
											<s:name>Sasa Stojanovic</s:name>
											<s:id>sasa.stojanovic@cimcollege.rs</s:id>
											<s:email>sasa.stojanovic@cimcollege.rs</s:email>
										</s:commentPerson>
										<s:commentDate>2011-11-08 14:04</s:commentDate>
									</s:issueComment>
									<s:issueComment>
										<s:commentId></s:commentId>
										<s:commentNumber>2</s:commentNumber>
										<s:commentText>New comment text</s:commentText>
										<s:commentPerson>
											<s:name>Sasa Stojanovic</s:name>
											<s:id>sasa.stojanovic@cimcollege.rs</s:id>
											<s:email>sasa.stojanovic@cimcollege.rs</s:email>
										</s:commentPerson>
										<s:commentDate>2011-11-15 14:55</s:commentDate>
									</s:issueComment>
									<!-- new issue attachments -->
									<s:issueAttachment>
										<s:attachmentId></s:attachmentId>
										<s:attachmentFilename></s:attachmentFilename>
										<s:attachmentType></s:attachmentType>
										<s:attachmentCreator>
											<s:name></s:name>
											<s:id></s:id>
											<s:email></s:email>
										</s:attachmentCreator>
									</s:issueAttachment>
									<!-- new issue activities (I also propose this structure in newIssueRequest if it's used there) -->
									<s:issueActivity>
										<s:activityId></s:activityId>
										<s:activityWho>lcanas@libresoft.es</s:activityWho>
										<s:activityWhen>2011-11-10 15:58:19</s:activityWhen>
										<s:activityWhat>Priority</s:activityWhat>
										<s:activityRemoved>medium</s:activityRemoved>
										<s:activityAdded>highest</s:activityAdded>
									</s:issueActivity>	
									<s:issueActivity>
										<s:activityId></s:activityId>
										<s:activityWho>lcanas@libresoft.es</s:activityWho>
										<s:activityWhen>2011-11-10 15:58:19</s:activityWhen>
										<s:activityWhat>CC</s:activityWhat>
										<s:activityRemoved>lcanas@libresoft.es</s:activityRemoved>
										<s:activityAdded></s:activityAdded>
									</s:issueActivity>
									<!-- new issue tracker -->
									<s:issueTracker>
										<s:issueTrackerId></s:issueTrackerId>
										<s:issueTrackerType>bugzilla</s:issueTrackerType>
										<s:issueTrackerURL>https://bugzilla.libresoft.es</s:issueTrackerURL>
									</s:issueTracker>
								</s:issue>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>